tshape_new_circle/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet_A
    {
       type             pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    inlet_B
    {
      type              pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
	
	axV
    {
        type            noSlip;
        value           uniform (0 0 0);
    }

    outlet
    {
         type           pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }


}

// ************************************************************************* //
