tshape_new_circle/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   
    inlet_A
    {
       type             fixedValue;
        value           uniform 0;
    }
    inlet_B
    {
       type             fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
   
    walls
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }
	
	 axV
    {
        type            fixedFluxExtrapolatedPressure;
        value           uniform 0;
    }

}

// ************************************************************************* //
