tshape_new_circle/0/phiE
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet_A
    {
       type            zeroGradient;
    }
    
    inlet_B
    {
      type            zeroGradient;
    }

    walls
    {
        type            fixedValue;
        value           uniform 160;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
	
	axV
    {
       type            zeroGradient;
    }

 
}

// ************************************************************************* //
