tshape_new_circle/0/theta
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 );
 
boundaryField
{

    inlet_A
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0 );
    }
    inlet_B
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0 );
    }

    walls
    {
        type            zeroGradient;
    }
    
	axV
    {
        type            zeroGradient;
    }
	
    outlet
    {
       type            zeroGradient;
    }
 
}

// ************************************************************************* //
