tshape_new_circle/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    tdSet;
        type    faceSet;
        action  new;
        source patchToFace;
        sourceInfo
        {
             name "inlet_A";
        }
    }
	
    
    {
        name    lrSet;
        type    faceSet;
        action  new;
        source patchToFace;
        sourceInfo
        {
             name "outlet";
        }
    }

      {
        name    tdSet;
        type    faceSet;
        action  delete;
        source  normalToFace;
        sourceInfo
        {
             normal (0 1 0);     // Vector
             cos     0.01;       // Tolerance (max cos of angle)
        }
      }

      

      {
        name    lrSet;
        type    faceSet;
        action  delete;
        source  normalToFace;
        sourceInfo
        {
             normal (1 0 0);     // Vector
             cos     0.01;       // Tolerance (max cos of angle)
        }
      }

   
);

// ************************************************************************* //
